{"url": "https://itviec.com/it-jobs/senior-backend-developer-java-vinamilk-0248", "job_title": "Senior Backend Developer (Java)", "work_model": "At office", "address": "Vinamilk Tower, 10 Tan Trao St., Tan Phu Ward., , District 7, Ho Chi Minh", "required_skills": ["Java", "Spring Boot", "PostgreSql", "AWS"], "time_posted_raw": "2025-12-26", "job_description": "As a backend engineer, you will be working within a specific problem where you will design, develop, and deploy backend services with a focus on scalability, high availability, and low latency.\nSolving complex technical and business problems and learning new technology and frameworks.\nBe part of a team that will take full responsibility for the features you own.\nDesign, develop, test, deploy, monitor, and improve, you are responsible for the full life-cycle of your product – build it, own it.", "your_skills_experience": "Must Have\nBachelor in Computer Sciences or related field or equivalent experience.\nAt least 5-year experience in working in enterprise and digital domains.\nStrong Java experience, Git source control, and Git Flow branching model.\nDeep understanding of API and REST services, as well as integration to mobile, web.\nSolid understanding of object-oriented programming.\nStrong problem-solving skills, able to work individually as well as in a team.\nGood English communication (read, write).\nNice to have\nExperience using third-party libraries like React and scripting like Groovy.\nStrong experience in Web development (HTML, CSS, Angular or similar).\nExperience in AWS, Ansible, Docker, K8s is a big plus.\nGood English listening and speaking is a big plus.", "company_name": "Vinamilk", "company_url": "https://itviec.com/companies/vinamilk", "company_type": "Non-IT", "company_industry": "Food and Beverage", "company_size": "1000+ employees", "country": "Vietnam", "working_days": "Monday - Friday", "overtime_policy": "No OT", "employment_benefits": ["Competitive salary and benefits on Top in VietNam.", "Attractive 13th-month salary and high performance bonus in the year.", "Annual performance review for salary raise and promotion.", "Premium private insurance with a discount for family members.", "Annual health check.", "Company trips and team buildings.", "Gifts on special accession: individual /company birthday, Tet, and Holidays.", "Internal activities, sport, and social clubs, gym, yoga, swimming…", "Opportunity to train both technical and soft skills to develop your career path."], "year": 2025.0, "month": 12.0, "day": 26.0, "normalized_level": "Senior", "normalized_exp_years": 0.0, "normalized_skills": ["Java", "Spring Boot", "PostgreSql", "AWS"]}
{"url": "https://itviec.com/it-jobs/salesforce-developer-all-level-up-to-55m-vnd-hybrid-technologies-0747", "job_title": "Salesforce Developer (All level) | Up to 55M VND", "work_model": "At office", "address": "Dong Nhan Building, 90 Nguyen Dinh Chieu, Da Kao, District 1, Ho Chi Minh", "required_skills": ["Salesforce", "Japanese", "English", "Apex"], "time_posted_raw": "2025-12-13", "job_description": "Use Salesforce APIs to integrate Salesforce with other tools and third-party applications\nActively focus on developing effective communication and relationship-building skills, with stakeholders, clients, and team.\nThorough understanding of Manufacturing data models, design considerations, and connected external systems\nData Migration in Salesforce\n*** Work location: 90 Nguyen Dinh Chieu, Đakao ward, Dist 1, HCM.", "your_skills_experience": "Must have: \nBachelor’s Degree in Computer Science or related field\nFrom 3 – 6+ years experience as a Salesforce Developer.\nHave Salesforce Platform Developer 1 Certified.\nApex development.\nHands-on experience in administration setup, e.g., managing users, security controls, and data as well as creating roles, profiles, and reports.\nExperience in designing custom objects, custom fields, picklists, page layouts, workflow, approval processes, validation rules, custom tabs, reports, Visualforce pages, dashboards, and email generation according to application requirements\nNice to have (Optional): \nCandidates with the following Salesforce certifications are preferred:\nSalesforce Administrator\nSalesforce Platform Developer I, II\nSalesforce Application Architect\nSalesforce Javascript Developer I\nSalesforce Certified Administrator (SCA)\nGood English or Japanese.", "company_name": "Hybrid Technologies", "company_url": "https://itviec.com/companies/hybrid-technologies", "company_type": "IT Outsourcing", "company_industry": "Software Development Outsourcing", "company_size": "501-1000 employees", "country": "Japan", "working_days": "Monday - Friday", "overtime_policy": "Extra salary for OT", "employment_benefits": ["Phúc lợi – Mức lương cạnh tranh và nhiều gói chế độ hấp dẫn khác;", "Phát triển cá nhân – Cơ hội tiếp cận nhiều công nghệ mới và nhiều cơ hội thử thách với các dự án khác nhau;", "Môi trường – Cơ hội làm việc trong môi trường chuyên nghiệp, sáng tạo, đa ngôn ngữ – Nơi mỗi cá nhân, tập thể tại Hybrid Technologies cùng nhau phát triển và nỗ lực hiện thực hóa giấc mơ chung.", "Chế độ lương – thưởng: Mức lương cạnh tranh & hấp dẫn. Lương tháng 13 và các khoản thưởng khác theo quy chế công ty. Phụ cấp ăn trưa, gửi xe hay quà tặng các ngày lễ trong năm (8/3, 20/10, Trung Thu, …). Chế độ tăng ngày phép theo thâm niên.", "Đánh giá hiệu suất công việc: 2 lần/năm.", "Chăm sóc sức khỏe: Gói bảo hiểm sức khỏe toàn phần dành cho nhân viên & mở rộng dành cho người thân nhân viên có thâm niên làm việc. Khám sức khỏe định kỳ hàng năm.", "Hoạt động ngoại khóa do công ty tài trợ: Hoạt động từ thiện. Các giải đấu do công ty tổ chức: Bóng đá, Bóng bàn, E-sport …", "Môi trường làm việc: Không gian chung và không gian làm việc xanh-sạch-năng động,  cùng trang thiết bị làm việc luôn được cập nhật mới nhất."], "year": 2025.0, "month": 12.0, "day": 13.0, "normalized_level": "All level", "normalized_exp_years": 0.0, "normalized_skills": ["Salesforce", "Japanese", "English", "Apex"]}
{"url": "https://itviec.com/it-jobs/senior-reactjs-engineer-hcm-nab-innovation-centre-vietnam-3003", "job_title": "Senior ReactJS Engineer - HCM", "work_model": "At office", "address": "The Hallmark, 15 Tran Bach Dang, Thu Thiem Ward, Thu Duc City, Ho Chi Minh", "required_skills": ["ReactJS", "TypeScript", "NodeJS", "JavaScript"], "time_posted_raw": "2025-11-28", "job_description": "By applying for the above position, you accept and agree that your personal data and any information stated in the attached curriculum vitae (CV) will be used and processed by ITViec and NAB Vietnam for recruitment purposes. The storage and processing of such information will comply with the applicable laws of Vietnam, and the policies and procedures of ITViec and NAB Vietnam regarding personal data, as amended from time to time.\n\nABOUT THE JOB\nWe are seeking motivated Senior ReactJS Engineers who are passionate, results focused to take accountability for the design and delivery of banking front end applications.\n\nYOUR JOB RESPONSIBILITIES\nCollaborate with other NAB’s technology leaders towards improving and fulfilling the NAB technical direction;\nDesign, develop, review, implement, and manage React.js application code and services for the production and pre-release environments;\nParticipate in Agile software development, prototyping, and code review with international development teams to build scalable microservices-based products;\nUnderstand the requirements of the customer or business and utilize this knowledge to develop applications that are consistent with this;\nWork with delivery teams to achieve success through development using CI/CD and DevOps practices, processes and tooling;\nProvide robust coding practices, solid unit/component test coverage, and debugging code;\nFreedom to make architectural and code-level decisions about the component you are working on. High level solution architecture decisions will be provided;\nPeer reviews of others code, and the ability to recommend changes and challenge decisions;\nFulfil other tasks as assigned by your People Leader and/or authorized representative of NAB Vietnam from time to time.", "your_skills_experience": "6 years’ + experience working in Software Development: Solid experience in JavaScript ES6/TypeScript working with React.js;\nEfficient in all areas of web development (HTML5, CSS3, Bootstrap, Foundation, JQuery, JSON) including accessibility and security concerns;\nExperience in Cloud computing and Amazon Web Services;\nStrong understanding of RESTful APIs design (GraphQL desirable) and Microservices-based system;\nStrong understanding of standard Software Engineering processes, Testing, and Agile methodology, experience in automation testing frameworks such as Playwright, Cypress, Selenium,… is preferred;\nWell-versed in writing structured, well-documented, maintainable, and clean code;\nStrong English communication skills (both verbal & written), especially in the global software development environment.\nNice-to-have:\nExperience in the Banking or Financial Services industry;\nExperience in using front-end testing and test runners (eg. Selenium, Mocha/Chai/Jest).\nAny additional certification or training in IT, Business, Computer Science, or related area.", "company_name": "NAB Innovation Centre Vietnam", "company_url": "https://itviec.com/companies/nab-innovation-centre-vietnam", "company_type": "IT Product", "company_industry": "Banking", "company_size": "1000+ employees", "country": "Australia", "working_days": "Monday - Friday", "overtime_policy": "No OT", "employment_benefits": ["Attractive salary and benefits", "20-day annual leave and 7-day sick leave, etc.", "13th month salary and Annual Performance Bonus", "Premium healthcare for yourself and family members", "Large scale products with modern technologies in banking domain", "Clear roadmap for career advancement in both technical and leadership pathways", "Sponsored certificates in both IT and banking/finance", "Premium accounts on Udemy/A Cloud Guru/Coursera/LinkedIn, etc.", "English learning with native teachers", "Hybrid working model and excellent work-life balance", "Well-equipped & modern Agile office with fully-stocked pantry", "Annual company trip and events"], "year": 2025.0, "month": 11.0, "day": 28.0, "normalized_level": "Senior", "normalized_exp_years": 0.0, "normalized_skills": ["ReactJS", "TypeScript", "NodeJS", "JavaScript"]}
{"url": "https://itviec.com/it-jobs/net-developer-english-onboard-after-tet-topicus-vietnam-1210", "job_title": ".Net Developer (English - Onboard after Tet)", "work_model": "Hybrid", "address": "106 Nguyen Van Troi Street, Phu Nhuan, Ho Chi Minh", "required_skills": [".NET", "Web API", "Entity Framework", "C#", "Azure", "SQL"], "time_posted_raw": "2025-12-05", "job_description": "We are seeking skilled .NET Developers with a minimum of 3 years of professional experience in .NET development. Successful candidates will join our international team and contribute to the development of our Akkuro Mortgage platform. This role involves close collaboration with team members in both Vietnam and the Netherlands, providing a dynamic and culturally diverse work environment.\n Responsibilities:\nDesign, develop, and maintain .NET applications with a focus on technical excellence.\nCollaborate effectively with international team members to deliver high-quality software solutions.\nParticipate in code reviews to ensure adherence to coding standards and best practices.\nTroubleshoot and resolve technical issues to ensure smooth project execution.\nCreate and maintain clear and comprehensive technical documentation.\nFrameworks and Tools Used:\n.NET Framework, .NET 8\nEntity Framework\nWeb API\nDependency Injection (Autofac)\nNServiceBus\nNHibernate\nAzure Pipelines\nHelm Charts", "your_skills_experience": "Bachelor's degree in Computer Science, Information Technology, or a related field.\nStrong English communication skills, both written and verbal.\nMinimum of 3 years of experience in .NET development.\nProficiency in C# and the .NET framework.\nExperience with SQL databases.\nStrong understanding of object-oriented programming principles.\nExcellent problem-solving skills and attention to detail.\nEffective communication and teamwork abilities.\nExperience with Azure DevOps and Azure Pipelines is a plus.\nExperience working in an international team is a plus.", "company_name": "Topicus Vietnam", "company_url": "https://itviec.com/companies/topicus-vietnam", "company_type": "IT Product", "company_industry": "Software Products and Web Services", "company_size": "51-150 employees", "country": "Netherlands", "working_days": "Monday - Friday", "overtime_policy": "No OT", "employment_benefits": ["Attractive salary (annual salary review).", "Fixed 13th-month salary and performance bonus.", "Full salary during probation and full coverage of social insurance.", "Hybrid working model and good work-life balance.", "Premium healthcare (with annual health check-up).", "16 days of annual leave per year.", "5 paid sick leave days.", "Dynamic and international English-speaking working environment.", "Regular gatherings (happy hour, bimonthly dinner, social events, etc.).", "Annual company trip.", "Fully stocked pantry with coffee and snacks.", "Budget for team activities.", "Supportive and diverse work environment that promotes continuous learning.", "Opportunity for traveling and training in the Netherlands."], "year": 2025.0, "month": 12.0, "day": 5.0, "normalized_level": "Junior", "normalized_exp_years": 0.0, "normalized_skills": ["NET", "Web API", "Entity Framework", "C#", "Azure", "SQL"]}
{"url": "https://itviec.com/it-jobs/fullstack-developer-location-da-nang-can-tho-hybrid-dirox-2548", "job_title": "FullStack Developer (Location: Da Nang, Can Tho, Hybrid", "work_model": "Hybrid", "address": "6 Tân Cảng, Binh Thanh, Ho Chi Minh", "required_skills": ["Java", "English", "ReactJS", "Angular"], "time_posted_raw": "2025-12-20", "job_description": "Join us as a Senior Full-Stack Developer to build next-generation applications. You will operate across the entire stack, delivering comprehensive solutions from database to user interface.\nEnd-to-End Delivery: Collaborate with cross-functional teams (PM, BA, UX, R&D) to turn concepts into fast, reliable production code.\nTechnical Versatility: Seamlessly switch between frontend, backend, and mobile technologies to meet project needs.\nOptimization: Proactively identify and eliminate scalability issues and performance bottlenecks across the stack.\nLeadership: Coach junior teammates, foster a culture of learning , and assist in technical recruitment.\nBest Practices: enforce high standards in coding, structure, and engineering processes.", "your_skills_experience": "Must Have\nExperience: 5+ years of professional development experience.\nBackend: Strong expertise in Java and RESTful APIs.\nFrontend: Advanced proficiency in Angular and/or React.\nDatabase: Experience with SQL/NoSQL databases (MySQL, MariaDB, PostgreSQL, MongoDB, Redis).\nArchitecture: Solid understanding of Microservices , OOP, SOLID, and Design Patterns.\nProcess & Tools:\nStrong knowledge of Deployment, CI/CD, and Pipelines.\nProficient in Version Control systems and Unit Testing (BDD, TDD).\nExperience with Authentication (OAuth2, OpenID, JWT).\nNice to Have\nAI Adoption: Ability to apply AI tools to enhance workflow and quality.\nDevOps: Familiarity with Cloud or On-premise infrastructure.\nProject Mindset: Ability to think holistically about the software context, not just isolated tasks.\nLanguage: High proficiency in English (Written & Spoken) is mandatory.", "company_name": "Dirox", "company_url": "https://itviec.com/companies/dirox", "company_type": "IT Service and IT Consulting", "company_industry": "IT Services and IT Consulting", "company_size": "51-150 employees", "country": "France", "working_days": "Monday - Friday", "overtime_policy": "Extra salary for OT", "employment_benefits": ["Competitive salary (and paid in full during probation)", "13th month bonus for all employees", "14th month bonus for exceptional performance", "Paid overtime (150-350%)", "Comprehensive health insurance", "14+ annual leave days (increasing with seniority)", "Monday to friday only work policy", "Flexible work schedule & remote options", "Free snacks, drinks, and parking", "Friendly relaxation space", "Fun get-togethers, activities, and sports clubs", "Annual company trip", "Professional & personal training allowance", "Mentorship from seasoned professionals", "Workshops & language classes", "International career opportunities (in Europe & America)", "R&D projects with social impact", "Charity events & aid", "Sponsor of kid's scholarships", "Human-sized company"], "year": 2025.0, "month": 12.0, "day": 20.0, "normalized_level": "Junior", "normalized_exp_years": 0.0, "normalized_skills": ["Java", "ReactJS", "Angular"]}
{"url": "https://itviec.com/it-jobs/appsec-devops-devsecops-engineer-python-cloud-aws-con-cung-3812", "job_title": "AppSec (DevOps/ DevSecOps) Engineer (Python/Cloud/AWS)", "work_model": "At office", "address": "5th Floor, Con Cưng Super Center, 09 Nguyen Trai Street, Ben Thanh Ward,, District 1, Ho Chi Minh", "required_skills": ["DevOps", "AWS", "Cloud", "English", "Python", "DevSecOps"], "time_posted_raw": "2025-12-20", "job_description": "Introduction\nCon Cung is the biggest omni-channel company for mom & baby with 600 retail stores in Vietnam in 2021 and plan to have 1,000 stores by 2023 with 1 billion USD revenue. Con Cung's annual growth rate is more than 70%. With the vision of providing good quality products for children, Con Cung is strongly investing into Product Research and Development in order to manufacture and provide products that are suitable to the local market in terms of pricing and quality. We also invest into technology in order to manage the network and online channel efficiently.\nCon Cung Corporation also develops in-house cutting-edge automation and intelligence technologies. We are seeking for young, smart & dynamic talents to grow your career together with us.\nJob Description\nWe are seeking an AppSec/DevSecOps Engineer to help establish and mature our application security and secure development practices. This role will initially focus on standardizing our DevOps pipelines and progressively integrate security into every stage of the software lifecycle. The engineer will support secure software design, application security testing, and developer enablement programs, with the long-term goal of leading our AppSec capability.\nKey Responsibilities\nDevOps Standardization: Streamline and standardize the company’s CI/CD pipelines for cybersecurity projects, preparing the foundation for DevSecOps integration.\nSecure SDLC Integration: Embed security controls and checks into software development workflows, from design to deployment.\nApplication Security Testing: Implement and maintain SAST, DAST, SCA, and other testing tools within pipelines; triage and coordinate fixes with developers.\nDeveloper Training & Security Champions: Deliver secure coding training, support Security Champions program, and promote security awareness among developers.\nSecurity by Design: Collaborate with architects and product teams to ensure applications are designed with security principles in mind (Threat Modeling, Secure Design Review, Security Requirement).\nFramework & Maturity Models: Contribute to the adoption of industry standards and frameworks such as OWASP SAMM for measuring and improving software assurance maturity.\nContinuous Improvement: Proactively recommend enhancements to DevSecOps tools, processes, and policies to improve resilience and efficiency.", "your_skills_experience": "2-3+ years of experience with DevOps practices (CI/CD, containerization, cloud-native deployment).\nExperience with DevSecOps integration in modern pipelines (GitLab CI, Jenkins, GitHub Actions, etc.).\nFamiliarity with application security testing tools (SAST, DAST, SCA, dependency scanning).\nKnowledge of secure software development practices (threat modeling, secure design principles, OWASP Top 10).\nStrong scripting/automation skills (Python, Bash, or similar).\nExcellent collaboration and communication skills, with the ability to work closely with developers, architects, and operations teams.\nA proactive attitude & the ability to think outside of the box\nWorks in an organised, structured manner\nCan do attitude, gets things done\nExcellent communication skills with diverse audiences\nStrong critical thinking and analytical skills\nExposure to security frameworks such as OWASP SAMM, BSIMM, or NIST SSDF.\nExperience delivering developer training or mentoring Security Champions.\nFamiliarity with infrastructure as code security (Terraform, Kubernetes, Helm).\nCloud security knowledge (AWS, Azure, GCP).\nEnglish communication.", "company_name": "Con Cưng", "company_url": "https://itviec.com/companies/con-cung", "company_type": "Non-IT", "company_industry": "Retail and Wholesale", "company_size": "1000+ employees", "country": "Vietnam", "working_days": "Monday - Friday", "overtime_policy": "No OT", "employment_benefits": ["Annual bonus: 2 - 3 months under minimum KPI requirement", "Fast promotion opportunities based on personal ability", "Work in a dynamic, open, creative environment", "Regular training, company team building, birthday bonus"], "year": 2025.0, "month": 12.0, "day": 20.0, "normalized_level": "Junior", "normalized_exp_years": 0.0, "normalized_skills": ["DevOps", "AWS", "Cloud", "Python", "DevSecOps"]}
{"url": "https://itviec.com/it-jobs/ai-engineer-golang-python-c-unity-machine-learning-zyneric-5600", "job_title": "AI Engineer (Golang/Python/C# Unity/Machine Learning)", "work_model": "At office", "address": "Tầng 6, tòa nhà LK, 399 Cộng Hòa, Tan Binh, Ho Chi Minh", "required_skills": ["AI", "Machine Learning", "Unity", "C#", "Golang", "Python"], "time_posted_raw": "2025-11-29", "job_description": "Develop and maintain AI-driven bots to automate in-game activities such as chatting, movement, or gameplay simulation. \nBuild spam/chat simulation tools for load testing, chat moderation testing, or behavior analysis. \nDesign AI chatbots that can communicate naturally with players (e.g., NPC dialogue or community chat). \nIntegrate bots with game servers, APIs, and databases. \nMonitor and optimize bot performance, ensuring stability and scalability. \nWork with game designers to simulate realistic player behavior for testing or analytics. \nEnsure compliance with platform and security rules (no cheating bots for production).", "your_skills_experience": "Strong experience with one or more of the following languages: Python, Go, or C# (Unity). \nFamiliar with AI/ML frameworks (TensorFlow, PyTorch, OpenAI API, Rasa, etc.) \nUnderstanding of network protocols, WebSocket, or REST API communication. \nKnowledge of natural language processing (NLP) or chatbot development is a plus. \nProblem-solving mindset, ability to think creatively to simulate human-like actions. \nNice to have: \nExperience with reinforcement learning (training bots to improve gameplay). \nExperience working with AI moderation, spam detection, or anti-cheat systems. \nUnderstanding of distributed systems for running large-scale bot farm\nExample Projects You Might Work On: \nChat simulation bot to test player chat system load and moderation filters. \nGameplay bot that mimics human interaction for QA or balance testing. \nNPC AI dialogue bot trained from player conversation logs. \nStress-testing tool using 1,000 concurrent bot users.", "company_name": "Zyneric", "company_url": "https://itviec.com/companies/zyneric", "company_type": "IT Product", "company_industry": "Software Development Outsourcing", "company_size": "1-50 employees", "country": "Vietnam", "working_days": "Monday - Friday", "overtime_policy": "No OT", "employment_benefits": ["Probation: 2 months with 100% salary during probation.", "Annual Leave: 14 days/year, calculated based on actual months worked.", "Allowances: Lunch, parking, mobile phone, and business trip expenses.", "Equipment: MacBook and mobile phone provided from the probation period.", "Activities & Perks: Annual teambuilding and company trip, monthly happy hours, snacks & cafeteria at the office.", "Working Hours: Flexible working arrangement, 8 hours/day at the office.", "Insurance: Full participation in Social Insurance, Health Insurance for employees and their family members.", "Bonuses & Gifts: 13th month salary, performance bonus, holiday bonuses, and Tet gifts."], "year": 2025.0, "month": 11.0, "day": 29.0, "normalized_level": "Junior", "normalized_exp_years": 0.0, "normalized_skills": ["AI", "Machine Learning", "Unity", "C#", "Golang", "Python"]}
{"url": "https://itviec.com/it-jobs/software-licensing-specialist-renesas-design-vietnam-0528", "job_title": "Software Licensing Specialist", "work_model": "At office", "address": "31 Tan Thuan, District 7, Ho Chi Minh", "required_skills": ["Data Analysis", "System Admin", "Database", "IT Support", "English"], "time_posted_raw": null, "job_description": "Given the growth of our enterprise both organic and through acquisitions, we are seeking a highly skilled and experienced Software Asset Management Specialist to join our Information Systems Commercial Operation team and work closely with SAM (Software Asset Management) Team. You will collaborate closely with stakeholders across various teams and departments to manage the Software and Software Services lifecycle.\nAs Software Asset Management Specialist, you will work proactively to:\nCollaborate with stakeholders to understand their SW and SW service needs,\nEngage vendors to procure Software and Software services,\nEnsure Vendors Software and Services are in compliance with Renesas policy and procedures.\nMaintain Software and Services and be the commercial contact to vendors.\nMonitor performance and optimize utilization.\nManage Renewals / Addon requests and Retirement of solutions.\nYou will have the chance to work within a global organization where we consider each challenge as an opportunity, a place where you can learn, grow your capabilities, and discover your potential.\nKey Responsibilities:\nStakeholder Collaboration: Partner with internal teams to understand software and software service requirements across the enterprise.\nVendor Engagement: Lead procurement activities by liaising with vendors to acquire software and services aligned with business needs.\nCompliance Assurance: Ensure all software and services comply with company policies, licensing agreements, and regulatory standards.\nDeployment Coordination: Work with relevant teams to support the deployment and integration of software solutions.\nLifecycle Maintenance: Act as the primary commercial contact for vendors, managing ongoing support, updates, and issue resolution.\nPerformance Monitoring: Track software usage and performance to identify optimization opportunities and ensure efficient utilization.\nRenewals & Retirement Management: Oversee software renewals, add-on requests, and the decommissioning of outdated or unused solutions.\nBudget Control: Manage software-related budgets, ensure cost-effective procurement, track expenditures, and identify opportunities for cost saving.\nProcess Improvement: Continuously evaluate and enhance SAM processes to support scalability and integration across entities.\nKey Performance Measures\nNew / Add-on / Renewal of Software and Software services agreements completed on time.\nMaintain Vendor, Software and Software Services data accurately and regularly.\nPlan and deliver monthly procurement plan for Software and Software services.\nVendor Onboarding process and required compliance controls done on time.\nQuarterly License and service performance reporting with suggestions for improvement\nBuild Dashboard and reports for Software Asset and Services", "your_skills_experience": "Bachelor’s degree in computer science, Engineering, or related field.\nMinimum 3 years of professional experience in global tech. industry, with roles in IT, SAM. Procurement.\nKnowledge in Software asset and vendor lifecycle process.\nStrong negotiation skills, particularly in vendor management, contract discussions, and procurement processes.\nGeneral knowledge in financial area (CAPEX, OPEX, budget management)\nGood skills in MS Office and tools\nExperience in Software Asset Management tools (e.g. Service Now, Coupa, Open IT, Altair or others)\nExperience with agile frameworks - like Scrum or Kanban\nExperience with FlexLM, or other license management tools, can represent an advantage.\nClear and professional English communication; Japanese proficiency is a plus.\nStrong interpersonal skills and confidence in cross-functional communication with internal and external people from a variety of backgrounds.\nDemonstrated problem-solving and multitasking abilities, resolving issues efficiently.", "company_name": "Renesas Design Vietnam", "company_url": "https://itviec.com/companies/renesas-design-vietnam", "company_type": "IT Product", "company_industry": "IT Hardware and Computing", "company_size": "1000+ employees", "country": "Japan", "working_days": "Monday - Friday", "overtime_policy": "Extra salary for OT", "employment_benefits": [], "year": null, "month": null, "day": null, "normalized_level": "Junior", "normalized_exp_years": 0.0, "normalized_skills": ["Data Analysis", "System Admin", "Database", "IT Support", "English"]}
{"url": "https://itviec.com/it-jobs/solution-architect-backend-dev-java-golang-python-vinsmart-future-0220", "job_title": "Solution Architect - Backend Dev(Java/ Golang/ Python)", "work_model": "At office", "address": "Tòa nhà TechnoPark, Oceanpark, Đa Tốn, Gia Lam, Ha Noi", "required_skills": ["Golang", "Java", "Python"], "time_posted_raw": "2025-12-16", "job_description": "Thiết kế, đánh giá và tối ưu kiến trúc hệ thống cho các ứng dụng như cần xử lý dịch vụ phức tạp và yêu cầu realtime, tính sẵn sàng/scaling, chịu lỗi cao như gọi xe, ghép chuyến, pricing...\nĐịnh nghĩa và chuẩn hóa kiến trúc SOA / microservices phục vụ đa ứng dụng, đa thị trường (multi-tenant, multi-region).\nPhân tích và re-engineer các hệ thống hiện tại để:\nNâng cao scalability, performance và availability.\nĐảm bảo observability, tracing, tuning.\nChịu lỗi resilience, fault tolerance, giảm downtime, nâng cao trải nghiệm người dùng.\nĐưa ra tiêu chuẩn kỹ thuật và làm việc cùng các đội phát triển (Dev & DevOps) triển khai đồng nhất theo best practices.\nLàm việc cùng Product Owner và Tech Lead để định hình kiến trúc, giải pháp kỹ thuật và lựa chọn công nghệ phù hợp.\nTìm hiểu, thử nghiệm, đánh giá, đề xuất triển khai các giải pháp, phát triển ứng dụng về cả luồng nghiệp vụ và nền tảng/non-functional requirements, bao gồm cả DevSecOps, Integration, Observability, Data. Định hướng phát triển dài hạn hướng tới Super App.\nĐóng góp ý kiến để cải thiện kiến trúc, hiệu năng, trải nghiệm người dùng cuối (response time, fault tolerance…).", "your_skills_experience": "Tối thiểu 3 năm kinh nghiệm phát triển backend và 2 năm kinh nghiệm kiến trúc hệ thống.\nCó hiểu biết về các ngôn ngữ và dev frameworks phổ biến và hiện đại, e.g. Java (e.g. Spring), Scala, python, Node.js (e.g. NestJS/Express), Go (e.g. Gin/Fiber), Rust (e.g. Rocket/Asum), Erlang/OTP, Spark (Java, Scala, python), Flink, Beam... \nHiểu biết và kinh nghiệm về SOA / Microservices, tích hợp hệ thống, DevSecOps …\nHiểu biết về protocols & patterns RESTful API, JWT/OAuth2, messaging, batch & streaming processing, multi thread, singleton… \nKinh nghiệm với Kubernetes, Docker, AWS/GCP (EKS/GKE, ECS, Cloud Run…), IaC.\nCó kinh nghiệm thiết kế cơ sở dữ liệu, thiết kế data model, tuning… trên các cơ sở dữ liệu, caching, message brocker như caching (Redis), messaging (Kafka), database (PostgreSQL, MongoDB, NoSQL…)….\nCó kinh nghiệm thiết kế multi-tenant system hoặc multi-region deployment.\nCó kiến thức về monitoring, logging, tracing (Prometheus, Grafana, ELK, OpenTelemetry…).\nCó tư duy hệ thống tốt, kỹ năng giao tiếp và phối hợp với các team.\nƯu tiên:\nCó kinh nghiệm trong lĩnh vực Mobility, Payment, Logistics, Super App.\nCó chứng chỉ AWS/GCP Architect hoặc Kubernetes Administrator.", "company_name": "VinSmart Future", "company_url": "https://itviec.com/companies/vinsmart-future", "company_type": "IT Service and IT Consulting", "company_industry": "IT Services and IT Consulting", "company_size": "1000+ employees", "country": "Vietnam", "working_days": "Monday - Saturday", "overtime_policy": "Extra salary for OT", "employment_benefits": ["Mức lương ưu đãi hơn thị trường", "Thưởng theo quy định công ty", "Khám sức khỏe theo quy định của công ty", "Máy tính xách tay theo quy định của công ty"], "year": 2025.0, "month": 12.0, "day": 16.0, "normalized_level": "Senior", "normalized_exp_years": 5.0, "normalized_skills": ["Golang", "Java", "Python"]}
{"url": "https://itviec.com/it-jobs/web-developer-javascript-html5-css-3-jquery-react-shinhan-ds-4115", "job_title": "Web Developer (Javascript, HTML5, CSS 3, JQuery, React)", "work_model": "At office", "address": "Floor 3, The Mett Tower, 15 Tran Bach Dang Street, Thu Thiem Ward,, Thu Duc City, Ho Chi Minh", "required_skills": ["JavaScript", "CSS 3", "Angular", "ReactJS", "JQuery", "HTML5"], "time_posted_raw": "2025-12-02", "job_description": "Develop, test and maintain responsive web applications and hybrid mobile app\nCollaborate with UI/UX designers to implement user friendly interface\nWrite clean code, maintainable code\nIntergate API and service into applications\nDebug, troubleshoot and resolve technical issues of banking products", "your_skills_experience": "Bachelor's degree in Computer Science, Software engineer, or related field (or equivalent practical experience)\nHave 2~5 years experience in web development\nProficiency in HTML5, CSS3, Javascript\nExperience with frontend framework/library JQuery, ReactJS, Angular... is big plus\nFamiliarity with backend technologies Java, NodeJS... (basic level is acceptable)\nKnowledge of RDBMS or NoSQL\nUnderstanding of RESTful API\nBasic knowledge of responsive design\nExperience on banking sector or fintech is big plus", "company_name": "SHINHAN DS", "company_url": "https://itviec.com/companies/shinhan-ds", "company_type": "IT Service and IT Consulting", "company_industry": "Banking", "company_size": "51-150 employees", "country": "South Korea", "working_days": "Monday - Friday", "overtime_policy": "Extra salary for OT", "employment_benefits": ["Salary: you will be happy.", "Performance review: twice a year.", "Incentive Programs to congratulate members' development.", "Company Trip, monthly/weekly activities and events.", "Health check once a year and advanced healthcare program.", "Free snack, coffee, sponsored pizza or chicken & beer parties.", "Work onsite with foreign teams for short or long term.", "Your solutions and opinions are heard."], "year": 2025.0, "month": 12.0, "day": 2.0, "normalized_level": "Junior", "normalized_exp_years": 0.0, "normalized_skills": ["JavaScript", "CSS 3", "Angular", "ReactJS", "JQuery", "HTML5"]}
{"url": "https://itviec.com/it-jobs/software-development-database-api-cloud-ngan-hang-a-chau-acb-2637", "job_title": "Giám Đốc Phát Triển Ứng Dụng (DevOps, Database, API)", "work_model": "At office", "address": "444 CMT8, Ward 11, District 3, Ho Chi Minh", "required_skills": ["Team Management", "Fullstack", "Java", "DevOps", "Cloud", "Database"], "time_posted_raw": "2025-12-03", "job_description": "Tóm tắt vai trò\nChịu trách nhiệm tổ chức, quản lý và vận hành toàn bộ hoạt động phát triển ứng dụng trong phạm vi phụ trách.\nĐảm bảo chất lượng sản phẩm phần mềm, tính ổn định – bảo mật của hệ thống, đồng thời phát triển năng lực đội ngũ nhân sự.\nGắn kết hoạt động phát triển ứng dụng với định hướng chiến lược chuyển đổi số, sản phẩm kinh doanh và trải nghiệm khách hàng cho người dùng\nTrách nhiệm chính\nQuản lý chiến lược & kế hoạch\nXây dựng kế hoạch phát triển ứng dụng ngắn hạn – dài hạn phù hợp với chiến lược CNTT và nhu cầu kinh doanh.\nĐề xuất công nghệ, kiến trúc giải pháp, lộ trình phát triển sản phẩm (roadmap).\nQuản lý ngân sách phát triển ứng dụng: chi phí nhân sự, hạ tầng, bản quyền phần mềm.\nĐội ngũ & nhân sự\nTrực tiếp hỗ trợ chuyên viên phát triển ứng dụng (Front-end, Back-end, Full-stack).\nĐào tạo, huấn luyện đội ngũ về công nghệ mới, phương pháp lập trình, chuẩn coding & security.\nQuản lý vận hành & dự án\nĐiều phối và giám sát quy trình phát triển phần mềm: từ phân tích yêu cầu – thiết kế – coding – test – triển khai – vận hành\nĐảm bảo các sản phẩm/dịch vụ CNTT được phát triển đáp ứng SLA, KPI chất lượng, hiệu suất và bảo mật.\nPhối hợp chặt chẽ với PMO, BA, QA, UI/UX và các khối kinh doanh để đảm bảo ứng dụng đáp ứng nhu cầu thực tế.\nXử lý các sự cố (incident) liên quan đến ứng dụng, đưa ra giải pháp khắc phục nhanh chóng.\nQuản lý công nghệ & quy trình\nThiết lập và chuẩn hóa quy trình phát triển phần mềm (Agile, DevOps, CI/CD).\nÁp dụng các best practices về code review, automated testing, security by design.\nĐịnh kỳ đánh giá, lựa chọn framework, ngôn ngữ, toolchains phù hợp để nâng cao năng suất.\nĐảm bảo tuân thủ các quy định nội bộ và chuẩn mực quốc tế (ISO, PCI DSS, GDPR, … nếu có liên quan).", "your_skills_experience": "Tốt nghiệp Đại học trở lên ngành CNTT, Khoa học Máy tính hoặc tương đương.\nTối thiểu 5 năm kinh nghiệm trong lĩnh vực phát triển phần mềm, trong đó ít nhất 3 năm ở vị trí quản lý.\nCó kinh nghiệm xây dựng, quản lý đội ngũ Dev (front-end, back-end, full-stack) từ 10–30 người trở lên.\nAm hiểu kiến trúc hệ thống, database, API, cloud (AWS/Azure/GCP), DevOps pipeline.\nƯu tiên ứng viên có kinh nghiệm lập trình trong các nhóm agile đa chức năng", "company_name": "Ngân Hàng Á Châu | ACB", "company_url": "https://itviec.com/companies/ngan-hang-a-chau-acb", "company_type": "IT Product", "company_industry": "Banking", "company_size": "1000+ employees", "country": "Vietnam", "working_days": "Monday - Friday", "overtime_policy": "No OT", "employment_benefits": ["Average 15 Monthly Base salary per year", "ACB Health Care.", "Meal Allowance.", "Preferential loan as regulated by ACB", "Yearly Medical Checkup & Team building activities.", "Professional and Transparent Working Environment"], "year": 2025.0, "month": 12.0, "day": 3.0, "normalized_level": "Director", "normalized_exp_years": 0.0, "normalized_skills": ["Team Management", "Fullstack", "Java", "DevOps", "Cloud", "Database"]}
{"url": "https://itviec.com/it-jobs/fullstack-developer-net-c-wpf-panasonic-vietnam-group-panasonic-r-d-center-vietnam-prdcv-3528", "job_title": "Fullstack Developer (.Net/C#/WPF)", "work_model": "At office", "address": "Lotte Tower, 54 Lieu Giai, Ba Dinh, Ha Noi", "required_skills": ["C#", "Windows Server", "WPF", "Database", "OOP", ".NET"], "time_posted_raw": "2025-12-18", "job_description": "· Design and develop Windows desktop applications using .NET (C#) and WPF for UI.\n· Implement secure communication protocols (MQTT, HTTP, SSL/TLS) and integrate with Service Bus.\n· Manage Windows Services, environment variables, accounts, and permissions for application\ndeployment.\n· Work with SQL Server for data storage and retrieval, ensuring efficient database operations.\n· Handle network share (UNC) access, ZIP archive processing, and related file operations.\n· Ensure robust error handling and detailed exception reporting for user awareness.\n· Create modular namespaces and classes for future integration with main codebase.\n· Optimize diagnostic tools to load data from the database and allow user interaction for quick tests and\nretries.\n· Maintain compliance with security and performance standards while minimizing third-party dependencies.\n· Work as assigned by Project manager/ Customers, support team members with complex functions.\n· Resolve issues proactively to deliver high quality products.", "your_skills_experience": "1. Must have\n· Strong experience in .NET Framework, C#, and WPF for desktop application development (5+ years of .NET/WPF). \n· Strong Object-Oriented Programming and Development skills. \n· Familiarity with SOAP/RESTful APIs to connect to backend services. \n· Developed visual components through WPF using XAML and Expression Blend. \n· Created middleware component classes across the enterprise and integrated in UI using MVVM pattern. \n· Worked on Binding, Styles, Data Template, Control Template, Converters, Layout Panels in XAML. \n· Implemented ADO.NET Entity Framework and LinQ to Object to connect to SQL server database from Repositories classes for retrieving, manipulating, querying, storing data from the database. \n· Created UML diagrams and wrote some Technical Design Documents before implementing new features. \n· Wrote Unit test cases using Visual Studio test tool. \n· Utilized TFS, GIT for source control. \n· Hands-on experience with Windows Services, Service Bus, and network configurations. \n· Proficiency in SQL Server and database schema design. \n· Knowledge of secure communication protocols (SSL/TLS, HTTP, MQTT). \n· Ability to write clean, maintainable code and follow best practices for exception handling and modular design. \n· Familiarity with Windows accounts and permissions, UNC paths, and ZIP archive handling. \n· Can use English (reading, writing, speaking).\n2. Nice to have\n· Ability to adapt to changing technology and priorities \n· Strong analytical thinking skills \n· Good planning, organizing, decision-making and problem-solving skills \n· Experience working in an Agile/Scrum environment. \n· Understanding of mobile development principles is a plus", "company_name": "Panasonic Vietnam Group – Panasonic R&D Center Vietnam (PRDCV)", "company_url": "https://itviec.com/companies/panasonic-vietnam-group-panasonic-r-d-center-vietnam-prdcv", "company_type": "IT Product", "company_industry": "IT Hardware and Computing", "company_size": "51-150 employees", "country": "Japan", "working_days": "Monday - Friday", "overtime_policy": "Extra salary for OT", "employment_benefits": [], "year": 2025.0, "month": 12.0, "day": 18.0, "normalized_level": "Junior", "normalized_exp_years": 0.0, "normalized_skills": ["C#", "Windows Server", "WPF", "Database", "OOP", ".NET"]}
{"url": "https://itviec.com/it-jobs/mlops-engineer-trusting-social-3232", "job_title": "MLOps Engineer", "work_model": "At office", "address": "Havana Tower - 132 Ham Nghi, District 1, Ho Chi Minh", "required_skills": ["Data modeling", "Computer Vision", "Data Science", "Algorithms", "MLOps", "Python"], "time_posted_raw": "2025-12-23", "job_description": "We are looking for qualified MLOps Engineer for the eKYC project, who will help us build up our digital identity verification products.\nYour primary focus will be:\n MLOps:\n- Apply MLOps techniques to optimize the AI model development process such as model serving, data/model versioning, autoML, and so on.\n- Developing and managing the backend system which encapsulates and provides control flow of various ML models.\n- Monitor and optimize system performance and resource consumption.\n Integrate ML models and ensure consistency in model interfaces and interaction as per product requirements.\n- Act as interfaces between product team, engineering team, data science  and infrastructure teams to ensure smooth integration of ML solutions.\n Modeling: \n- Developing various ML models in the field of computer vision and implementing novel solutions for diverse ML problems (supervised, semi-supervised, unsupervised, one-class).\n- Optimize and deploy \"tiny\" ML solutions on limited computation power devices such as mobile devices and web platforms.", "your_skills_experience": "BS/MS in computer science or related fields \nHaving 1 years of experience in Data science and MLOps\nMust be proficient in software design and software development.\nMust be proficient in Python, scripting language. Experience with other programming languages (C++, Java, Javascript ...) is a plus\nMust be proficient in Linux system, version control system (Git), virtualization and SW packaging tool (docker)\nGreat communication skills\n Desired Skills:\n- Experience with ML framework: Tensorflow, Pytorch, Mxnet, ONNX, Pandas, Numpy, kuberflow pipeline, airflow\n- Experience with managing data science and computer vision toolkit, such as JupyterHub, OpenCV... is a plus\n- Experience with Cloud Storage, CICD/Github workflows and Triton server are big pluses\n- Experience with working with databases and query language is a plus.\n- Familiar with MLOPs concept and toolkit is a plus\n- Basic understanding of machine learning techniques and algorithms\n- BS/MS in Computer Science with focus on machine learning is a plus", "company_name": "Trusting Social", "company_url": "https://itviec.com/companies/trusting-social", "company_type": "IT Service and IT Consulting", "company_industry": "Financial Services", "company_size": "301-500 employees", "country": "Singapore", "working_days": "Monday - Friday", "overtime_policy": "No OT", "employment_benefits": ["Competitive compensation package, including 13th-month salary and performance bonuses", "Comprehensive health care coverage for you and your dependents", "Generous leave policies, including annual leave, sick leave, and flexible work hours", "Convenient central district 1 office location, next to a future metro station", "Onsite lunch with multiple options, including vegetarian", "Grab for work allowance and fully equipped workstations", "Fun and engaging team building activities, sponsored sports clubs, and happy hour every Thursday", "Unlimited free coffee, tea, snacks, and fruit to keep you energized", "An opportunity to make a social impact by helping to democratize credit access in emerging markets."], "year": 2025.0, "month": 12.0, "day": 23.0, "normalized_level": "Junior", "normalized_exp_years": 0.0, "normalized_skills": ["Data modeling", "Computer Vision", "Data Science", "Algorithms", "MLOps", "Python"]}
{"url": "https://itviec.com/it-jobs/fullstack-developer-java-sapo-2946", "job_title": "8 Fullstack Dev (Java/ Spring Boot/ ReactJS/ NoSQL)", "work_model": "At office", "address": "266 Đội Cấn, Ba Dinh, Ha Noi", "required_skills": ["Java", "NoSQL", "Spring", "Fullstack", "Microservices", "ReactJS"], "time_posted_raw": "2025-12-16", "job_description": "Sử dụng Java phát triển các service sử dụng REST API (Java, Spring Boot) trong hệ thống kiến trúc Microservices\nLập trình frontend cho các dự án phát triển sản phẩm \nTham gia phát triển nền tảng quản lý & bán hàng trên hệ thống Sapo: quản lý bán hàng, quản lý kho, quy trình hoàn tất đơn hàng, phát triển các kênh bán hàng POS, Web, Marketplace, Social…\nTham gia phân tích nghiệp vụ, đảm bảo chất lượng, tiến độ công việc và trải nghiệm người dùng (hiệu năng, tính dễ sử dụng, cũng như mức độ ổn định của sản phẩm).\nTriển khai các hạng mục công việc theo nhiệm vụ được giao. Tham gia & kiểm soát các hạng mục phát triển tính năng mới, cải tiến tính năng cũ nhằm đảm bảo chất lượng và khả năng mở rộng.\nPhối hợp với team nghiên cứu và ứng dụng các công nghệ mới để triển khai tính năng mới, đồng thời cải tiến liên tục các hạng mục đã ra mắt nhằm tối ưu hiệu năng & duy trì ổn định sản phẩm.", "your_skills_experience": "Tốt nghiệp chuyên ngành Công nghệ thông tin và các chuyên ngành liên quan khác.\nCó từ 2 năm kinh nghiệm Fullstack trở lên (Backend/ Java/ Spring Boot và Frontend/  ReactJS/ AngularJS/ VueJS,… )\nSử dụng thành thạo Git hoặc SVN.\nHiểu biết các Framework: Spring, Hibernate.\nCó hiểu biết tốt về Design pattern, OOP, REST API.\nCó kinh nghiệm & hiểu biết về xây dựng hệ thống Microservice.\nCó tư duy logic tốt, khả năng tự tìm hiểu & giải quyết vấn đề tốt\nCó kiến thức về cơ sở dữ liệu quan hệ Mariadb, MySQL.\nƯu tiên có kinh nghiệm về Domain Driven Design, NoSQL (Redis, MongoDB), các hệ thống Message Queue (Kafka, RabbitMQ).\nChủ động trong công việc, có tinh thần trách nhiệm cao.\nChủ động phối hợp với thành viên trong team để giải quyết vấn đề, thực hiện mục tiêu.\nƯu tiên có kinh nghiệm vận hành hệ thống AWS là 1 lợi thế.", "company_name": "SAPO", "company_url": "https://itviec.com/companies/sapo", "company_type": "IT Product", "company_industry": "Software Products and Web Services", "company_size": "1000+ employees", "country": "Vietnam", "working_days": "Monday - Friday", "overtime_policy": "No OT", "employment_benefits": ["Phát triển công nghệ sâu, môi trường product đáng để làm. Sếp rất quan tâm nhân viên. Môi trường mở rộng sáng tạo và cơ hội cho lập trình lên từ junior - expert.", "Bạn sẽ có cơ hội phát triển sự nghiệp rất rộng mở, phát triển lên vị trí cao hơn cũng như có thể trở thành chuyên gia (chúng tôi đã chuẩn bị sẵn lộ trình công danh), đảm bảo không giới hạn nếu như bạn có đủ đam mê và quyết tâm.", "Các ứng viên phù hơp có thể phỏng vấn trước Tết, nhận việc sau Tết", "Được tham gia đóng góp cho sản phẩm phẩm từ lúc lên yêu cầu.", "Cấp máy tính cấu hình cao, phụ cấp cơm trưa.", "Làm việc từ Thứ 2 - Thứ 6", "Được xét tăng lương 2 lần/ năm", "Chế độ BHXH, BHYT theo luật Lao động, ngoài ra được tham gia chương trình bảo hiểm Sapo Care.", "Được tham gia các khoá đào tạo từ các chuyên gia hàng đầu về thương mại điện tử, marketing online, phần mềm ...", "Được làm việc trong môi trường chuyên nghiệp, trẻ trung, năng động."], "year": 2025.0, "month": 12.0, "day": 16.0, "normalized_level": "Junior", "normalized_exp_years": 0.0, "normalized_skills": ["Java", "NoSQL", "Spring", "Fullstack", "Microservices", "ReactJS"]}
{"url": "https://itviec.com/it-jobs/da-nang-full-stack-developer-reactjs-nodejs-one-tech-stop-vietnam-company-ltd-0212", "job_title": "[Da Nang] Full-Stack Developer (ReactJS/ NodeJS)", "work_model": "At office", "address": "Tầng 3-4 tòa nhà Phi Long, 52 Nguyễn Văn Linh, Hai Chau, Da Nang", "required_skills": ["NodeJS", "MongoDB", "ReactJS", "NextJS", "TypeScript", "SQL"], "time_posted_raw": "2025-12-27", "job_description": "The developer will be involved in all phases of the product development cycle including requirements analysis, project estimation, detailed design, software development, testing, and deployment. \nHe/she has A Good Mindset for Development schedule/Quality/Self-Study and is willing to learn new technologies.\nWhat you will do\nPerform development & testing features/bugs from backlog items.\nResponse quickly to handle incidents if it happens.\nBuild and maintain the CI/CD.\nBe Involved in Quality Assurance with good processes, practices, and analysis tools.\nBe Involved in developing Non-Functional Requirements (e.g. Performance, Security, Reliability, Maintainability…)\nAssists leaders to define Technical Backlog\nBe Involved in defining Roadmap and Risk Management.\nResponsible for being committed to the results to be delivered by his/her team and assists his/her teams in achieving such results.\nResponsible for objectively and effectively communicating with his/her counterparts, leaders, and team members\nResponsible for providing his/her team with feedback on their work.\nDeveloping ideas for new programs, products, or features by monitoring industry developments and trends.", "your_skills_experience": "We are looking for the one who:\nHaving experience in Web Front-end (HTML/CSS/JS), NextJS or ReactJS\nHaving experience in backend technology of Nodejs and TypeScript and frameworks available for Nest.js\nDatabase programming or design skills, including relational database skills (SQL, etc.) and non-relational database skills (MongoDB, Redis, Cassandra, etc.).\nCODING: The code should be well documented and compliant with good practices, as well as the testing skill (Unit Test, Integration Test, User Acceptance Test, Automation Regression Test.\nRESTful API\nKnowledge of Programming Principles, Design Patterns, etc;\nWilling to learn new technology and have a product mindset.\nNice to have:\nExperience in cloud architecture/infrastructure, especially on GCP\nExperience with Docker;\nKnowledge about Continuous Integration, Continuous Delivery (CI/CD);\nFamiliar with working in an Agile environment;", "company_name": "ONE Tech Stop Vietnam Company Ltd", "company_url": "https://itviec.com/companies/one-tech-stop-vietnam-company-ltd", "company_type": "IT Product", "company_industry": "IT Services and IT Consulting", "company_size": "151-300 employees", "country": "Singapore", "working_days": "Monday - Friday", "overtime_policy": "Extra salary for OT", "employment_benefits": ["Competitive salary", "Annual Increment", "13th-month salary", "Performance Bonus", "Social Security co-contribution based on full gross salary", "Premium health care (Bao Viet Insurance) for employees & dependents (parents or spouse + children).", "Lunch allowance", "Free drinks and snacks", "17 days of Annual Leave", "Annual health screening reimbursement: VND4,700,000/year", "Well-being allowance: VND13,800,000 VND/year", "Training and education sponsorship: 38,000,000/year"], "year": 2025.0, "month": 12.0, "day": 27.0, "normalized_level": "Junior", "normalized_exp_years": 0.0, "normalized_skills": ["NodeJS", "MongoDB", "ReactJS", "NextJS", "TypeScript", "SQL"]}
{"url": "https://itviec.com/it-jobs/data-engineer-sql-python-cloud-megazone-5325", "job_title": "Data Engineer (SQL/ Python/ Cloud)", "work_model": "At office", "address": "54 Lieu Giai, Ba Dinh, Ha Noi", "required_skills": ["Data Engineer", "Databricks", "Data Warehousing", "Big Data", "Database", "MLOps"], "time_posted_raw": "2025-12-20", "job_description": "MEGAZONE Vietnam is looking for a highly skilled Data Engineer with strong experience to join our dynamic global team. The ideal candidate will be responsible for building, and optimizing large-scale data pipelines, ensuring scalability, performance, and reliability. You will collaborate closely with offshore teams at MEGAZONE CLOUD and external partners\nWhat You Will Do:\nCollaborate with AI engineers, data scientists, and business stakeholders to understand ML-specific data requirements and deliver clean, reliable, well-architectured datasets.\nDesign, build, and maintain feature engineering pipelines and feature stores for machine learning models.\nBuild low-latency, scalable pipelines for both batch and real-time AI workloads.\nAutomate model training, deployment, and monitoring using AWS SageMaker, MLflow, or similar tools.\nBuild data ingestion pipelines from structured and unstructured data sources (e.g., APIs, databases, files, streaming data).\nMentor junior engineers and review code to ensure best engineering practices are followed", "your_skills_experience": "Basic Qualifications:\nBachelor’s or Master’s degree in Computer Science, Engineering, Information Systems, or related field.\n1- 5 years of experience in data engineering or a related field. (5 years+ with Senior level)\nKnowledge of data modeling for AI, including feature stores and time-series datasets.\nStrong proficiency in SQL and Python skills.\nExperience with cloud platforms: AWS, Azure, or GCP (preferably AWS).\nFamiliarity with CI/CD, Git, and DevOps practices for data and ML systems.\nStrong understanding of data security, privacy, and compliance practices.\nPreferred Qualifications\nExperience with real-time data processing ( Kafka, Kinesis, Spark Streaming..).\nHands-on experience with DataBricks, Snowflake\nFamiliarity with data lakehouse and cloud data warehouse concepts.\nExposure to machine learning pipelines and MLOps concepts\nUnderstanding of MLOps best practices and AI model lifecycle management.\nKnowledge of data governance frameworks and metadata management.", "company_name": "MEGAZONE", "company_url": "https://itviec.com/companies/megazone", "company_type": "IT Product", "company_industry": "IT Services and IT Consulting", "company_size": "1-50 employees", "country": "South Korea", "working_days": "Monday - Friday", "overtime_policy": "No OT", "employment_benefits": ["The attractive salary (Negotiation)", "2-month probation period with 100% salary.", "Full salary insurance coverage after the probation period.", "Participation in the PVI health insurance package, and annual health check-ups.", "13th-month salary, birthday bonus, New Year bonus, Mid-Autumn Festival gifts, March 8th and October 20th gifts, etc.", "Performance evaluation and regular salary increases.", "Welfare for personal events, childbirth, and other benefits as per labor regulations and company welfare policies.", "Dynamic and youthful work environment conducive to personal growth and development.", "Company: Megazone Vietnam", "Working Hours:\nStandard: 8:30 AM – 5:30 PM (Lunch: 12:00 PM – 1:00 PM), Monday to Friday\nFlexible working hours may apply depending on project (e.g., 1:00 PM – 9:00 PM)", "Standard: 8:30 AM – 5:30 PM (Lunch: 12:00 PM – 1:00 PM), Monday to Friday", "Flexible working hours may apply depending on project (e.g., 1:00 PM – 9:00 PM)", "Location: 27th Floor, East Tower, Lotte Center Hanoi, 54 Lieu Giai, Ba Dinh District, Hanoi, Vietnam"], "year": 2025.0, "month": 12.0, "day": 20.0, "normalized_level": "Junior", "normalized_exp_years": 0.0, "normalized_skills": ["Data Engineer", "Databricks", "Data Warehousing", "Big Data", "Database", "MLOps"]}
{"url": "https://itviec.com/it-jobs/fullstack-developer-net-reactjs-cong-ty-tnhh-dau-tu-nghien-cuu-va-phat-trien-phan-mem-viet-nam-0838", "job_title": "Fullstack Developer (.NET, ReactJS)", "work_model": "At office", "address": "Tầng 4, tòa nhà HUD3 Tower, số 121-123 đường Tô Hiệu, Phường Nguyễn Trãi, Ha Dong, Ha Noi", "required_skills": ["ReactJS", "C#", "SQL", ".NET", "JavaScript"], "time_posted_raw": "2025-12-14", "job_description": "Tham gia phát triển và bảo trì hệ thống phần mềm nội bộ hoặc các sản phẩm khác của công ty.\nTham gia vào quá trình phân tích yêu cầu, thiết kế hệ thống và xây dựng tài liệu kỹ thuật.\nPhối hợp với các thành viên khác trong team để hoàn thiện chức năng, sửa lỗi và tối ưu hóa hiệu suất hệ thống.\nThực hiện unit test và đảm bảo chất lượng phần mềm trước khi bàn giao hoặc triển khai.", "your_skills_experience": "Trình độ học vấn\nTốt nghiệp Cao đẳng/Đại học chuyên ngành Công nghệ thông tin hoặc lĩnh vực liên quan.\nKinh nghiệm chuyên môn\nCó ít nhất 1,5 năm kinh nghiệm với các công nghệ sau:\nFrontend: ReactJS, JavaScript, TypeScript\nBackend: C# sử dụng .NET Core hoặc .NET Framework (không yêu cầu ASP.NET)\nCơ sở dữ liệu: Thành thạo SQL, đặc biệt là SQL Server\nƯu tiên\nƯu tiên ứng viên có kinh nghiệm hoặc hiểu biết về:\nSelenium (Python/C#/Java) hoặc Puppeteer (Node.js) để tự động hóa trình duyệt\nThu thập dữ liệu, tự động hóa tương tác web, kiểm thử UI tự động\nElectronJS: Có kinh nghiệm phát triển ứng dụng desktop cross-platform\nKỹ năng mềm\nTư duy logic tốt, có khả năng giải quyết vấn đề.\nCó trách nhiệm với công việc, chủ động trong quá trình thực hiện nhiệm vụ.\nCó tinh thần học hỏi và khả năng làm việc nhóm tốt.", "company_name": "CÔNG TY TNHH ĐẦU TƯ NGHIÊN CỨU VÀ PHÁT TRIỂN PHẦN MỀM VIỆT NAM", "company_url": "https://itviec.com/companies/cong-ty-tnhh-dau-tu-nghien-cuu-va-phat-trien-phan-mem-viet-nam", "company_type": "IT Product", "company_industry": "E-commerce", "company_size": "1-50 employees", "country": "Vietnam", "working_days": "Monday - Friday", "overtime_policy": "No OT", "employment_benefits": ["Lương cơ bản: 10.000.000 – 20.000.000 VNĐ/tháng (thỏa thuận theo năng lực).", "Được đóng BHXH theo đúng quy định của Nhà nước.", "Thời gian làm việc: 08h00 – 12h00 và 13h30 – 17h30.", "Nghỉ thứ 7, Chủ nhật và các ngày nghỉ lễ theo quy định của Nhà nước."], "year": 2025.0, "month": 12.0, "day": 14.0, "normalized_level": "Junior", "normalized_exp_years": 0.0, "normalized_skills": ["ReactJS", "C#", "SQL", ".NET", "JavaScript"]}
{"url": "https://itviec.com/it-jobs/senior-full-stack-engineer-nodejs-reactjs-ringkas-3926", "job_title": "Senior Full Stack Engineer (NodeJS, ReactJS)", "work_model": "At office", "address": "Lakeview 1, No.19 To Huu Street, Thu Thiem Ward, Thu Duc City, Ho Chi Minh City, Vietnam, Thu Duc City, Ho Chi Minh", "required_skills": ["NodeJS", "GraphQL", "ReactJS", "TypeScript", "AWS", "English"], "time_posted_raw": "2025-12-16", "job_description": "We are building a next-generation fintech ecosystem that connects users with seamless financial services. As part of this vision, we are creating a real-time chat\nplatform to enhance communication, customer support, and secure financial interactions.\nWe are looking for a Software Engineer who has strong experience in real-time applications and cloud-based architecture to join our team and lead the development of this platform.\nResponsibilities\nDesign, develop, and maintain a real-time chat platform integrated into our fintech ecosystem.\nExperienced in building backend services that can scaled using Node.js (WebSockets, REST APIs, GraphQL).\nDevelop modern, responsive frontend interfaces with React.js.\nEnsure security, compliance, and data protection standards are met (especially for financial data).\nExperience chat/messaging system is a plus (Group chats, message history, file sharing, push notifications, and user presence.\nDevelop with DevOps Culture in mind, understanding and maintaining solutions on AWS (Lambda, ECS, S3, DynamoDB/RDS, API Gateway, CloudFront, etc.).\nOptimize for high availability, low latency, and scalability to support thousands of concurrent users.\nCollaborate with product managers, designers, and other engineers to deliver a seamless experience.", "your_skills_experience": "5+ years of experience in full-stack development (Node.js + React.js).\nStrong experience with real-time communication (WebSockets, Socket.io, WebRTC, or similar).\nUse message queues (Kafka, RabbitMQ, AWS SQS/SNS, or similar) to handle real-time messaging, scaling, and event-driven architecture.\nSolid knowledge of AWS cloud architecture (serverless, microservices, CI/CD pipelines).\nHave experience with in-app notification system (firebase, aws pinpoint, custom, ...)\nFamiliarity with databases both SQL and NoSQL.\nStrong understanding of authentication, authorization, and encryption in realtime apps.\nExperience in building secure, high-performance systems for fintech, banking, or similar regulated environments is a plus.\nGood understanding of Agile development, Git workflows, and DevOps practices.\nNice to Have\nExperience with chatbot/AI assistant integration.\nKnowledge of Kubernetes/Docker for containerized deployment.\nFamiliarity with finance systems, KYC, and fintech APIs.\nHas worked in a Startup environment, Banking or Fintech", "company_name": "Ringkas", "company_url": "https://itviec.com/companies/ringkas", "company_type": "IT Product", "company_industry": "IT Services and IT Consulting", "company_size": "51-150 employees", "country": "Indonesia", "working_days": "Monday - Friday", "overtime_policy": "No OT", "employment_benefits": ["13th month salary", "14 Days Paid Annual Leave", "Competitive salary and performance-based bonuses.", "Performance review: twice a year", "100% monthly basic salary and mandatory social insurances after 2-month probation", "Company sponsorship for personal laptop $1,400 or BYOD (bring your own device) option with bonus $1,400", "Premium Health Insurance (after probation period) & annual health check-up", "Allowances such as: Premium AI tool, Coffee, Snacks, Motorbike parking.", "Happy hour, Team bonding, Company trip", "Gifts on holidays, parking, wedding & newborn baby allowance", "Collaborative and innovative culture.", "Hybrid working environment (2 days/week)"], "year": 2025.0, "month": 12.0, "day": 16.0, "normalized_level": "Senior", "normalized_exp_years": 0.0, "normalized_skills": ["NodeJS", "GraphQL", "ReactJS", "TypeScript", "AWS"]}
{"url": "https://itviec.com/it-jobs/solution-architect-open-for-sa-devlead-mb-bank-5148", "job_title": "Solution Architect (open for SA, Devlead)", "work_model": "At office", "address": "Tòa nhà MB, số 18 Lê Văn Lương, Phường Yên Hòa, Ha Noi", "required_skills": ["Solution Architecture", "Redis", "Java", "Microservices", "Cloud", "Oracle"], "time_posted_raw": "2025-12-13", "job_description": "HOLT.10 - Chuyên gia, Chuyên viên cao cấp Kiến trúc ứng dụng\nChủ trì xây dựng thiết kế giải pháp cho các sản phẩm, đáp ứng nhu cầu nghiệp vụ và phù hợp tiêu chuẩn kiến trúc, công nghệ:\nTham gia làm rõ đầu bài và tư vấn cho nghiệp vụ, BA về yêu cầu đầu bài\nXây dựng thiết kế tổng thể giải quyết bài toán nghiệp vụ\nPhối hợp với các AA xây dựng thiết kế chi tiết để giải quyết bài toán nghiệp vụ\nPhối hợp với các AA kiểm soát các phát triển tuân thủ thiết kế\nTham gia xây dựng Kiến trúc tham chiếu của MB: Tham gia team cùng với EA, AA xây dựng các mẫu thiết kế, cây quyết định, tài liệu hướng dẫn, mã nguồn mẫu đáp ứng các tiêu chuẩn, nguyên tắc thiết kế, kiến trúc\nTham gia xây dựng các quy hoạch:\nCung cấp các thông tin, thực hiện khảo sát hiện trạng phục vụ quy hoạch\nTham gia đánh giá và đề xuất giải pháp quy hoạch\nCác công việc khác:\nTham gia review sự cố các hệ thống/giải pháp được phân giao.\nPhối hợp với các bên liên quan để đề xuất và xác định kích thước (sizing) hệ thống.\nTham gia thử nghiệm, đánh giá công nghệ mới", "your_skills_experience": "Tốt nghiệp Đại học ngành Công nghệ thông tin, Toán học, Điện tử viễn thông tại các trường đại học uy tín như Đại học Bách Khoa, Đại học Quốc gia, … hoặc có chứng chỉ lập trình viên quốc tế tương đương.\nTối thiểu 04 năm kinh nghiệm lập trình và thiết kế phần mềm\nCó kiến thức về nhiều ngôn ngữ: Java,go, python …\nHiểu biết tốt về các về các framework : Spring, Angular, React , Go-zero ....\nHiểu biết tốt về các dòng database : Oracle, MySQL, Mongodb …\nHiểu biết tốt về các ứng dụng nền tảng và kiến trúc triển khai: Redis, kafka, GG ...\nHiểu biết tốt về các mô hình kiến trúc : Monolitic, Microservice, Serverless, Event-Driven ...Các mô hình kiến trúc khác: Mini fontend, Miniapp ...\nAm hiểu về thiết kế ứng dụng trên nhiều khía cạnh như tích hợp, bảo mật, quy hoạch mạng …\nHiểu biết và có kiến thức thực tế với các mô hình phát triển như waterfall, agile ...\nCó kinh nghiệm làm việc trên các nên tảng private cloud, public cloud, các nền tảng containerization\nVị trí mở với các senior dev có định hướng chuyển sang SA\nNgoại ngữ (Tiếng Anh) - TOEIC tối thiểu 550", "company_name": "MB Bank", "company_url": "https://itviec.com/companies/mb-bank", "company_type": "IT Product", "company_industry": "Banking", "company_size": "1000+ employees", "country": "Vietnam", "working_days": "Monday - Friday", "overtime_policy": "Extra salary for OT", "employment_benefits": ["Thưởng thành tích tháng 13; Thưởng thành tích theo kết quả công việc 06 tháng, 1 năm ; Thưởng các dịp lễ tết trong năm ; Thưởng theo danh hiệu cá nhân và tập thể…", "Du lịch nghỉ dưỡng hàng năm", "Khám sức khỏe định kì", "Gói bảo hiểm sức khỏe cá nhân và người thân (MIC)", "Quà tặng và ngày nghỉ sinh nhật hưởng nguyên lương", "Được thử sức với các nền tảng công nghệ mới, tham gia vào những dự án chuyển đổi lớn của ngân hàng", "Có cơ hội học hỏi từ các Chuyên gia, Lãnh đạo nội bộ hàng đầu tại MB trong lĩnh vực IT, Tài chính ngân hàng", "Được trải nghiệm các phương pháp học tập mới và phát triển năng lực theo lộ trình công danh.", "Hưởng các chính sách hỗ trợ, khuyến khích học tập, nâng cao trình độ và phát triển bản thân (chứng chỉ nghề quốc tế...)", "Những người cộng sự thân thiện và tài năng", "Cơ sở vật chất, không gian làm việc xanh và hiện đại."], "year": 2025.0, "month": 12.0, "day": 13.0, "normalized_level": "Senior", "normalized_exp_years": 0.0, "normalized_skills": ["Solution Architecture", "Redis", "Java", "Microservices", "Cloud", "Oracle"]}
{"url": "https://itviec.com/it-jobs/senior-devops-engineer-agile-aws-mercatus-4926", "job_title": "Senior DevOps Engineer (Agile, AWS)", "work_model": "At office", "address": "9th Floor, Dreamplex Building,195 Đien Bien Phu, Ward 15, Binh Thanh, Ho Chi Minh", "required_skills": ["DevOps", "AWS", "Agile"], "time_posted_raw": "2025-12-14", "job_description": "The DevOps Engineer role at Mercatus includes (but is not limited to):\nCollaborate with developers to support deployment and automation needs.\nSupport and enhance CI/CD pipelines with Jenkins and ArgoCD to automate deployment to Kubernetes.\nHandle lifecycle management and upgrades for Kubernetes clusters (EKS) and associated resources.\nEnhancing infrastructure and application monitoring and alerting using the Grafana LGTM stack.\nMaintain and improve Kubernetes observability and alerting systems.\nApply security best practices in Kubernetes, including RBAC, network isolation, and secret management.\nImplemented advanced Kubernetes features such as HPA, PDBs, advanced scheduling.\nConfigure and manage Ingress Controllers, network policies, custom Helm charts, and resource limits/requests for fine-grained control\nParticipate in off-hours/on-call support rotation and be willing to handle urgent production issues during mid-night or non-working hours when required.", "your_skills_experience": "Bachelor's or Master's degree in Computer Science, Information Technology, or a related field.\n5+ years of experience with automated provisioning, Cloud Infrastructure, Continuous Integration, Deployment Pipelines.\nUnderstanding of a relevant scripting language (eg: python. bash).\nSolid understanding of AWS core services, including S3 bucket, EC2, EKS, VPC, Load Balancers, and NAT Gateway,...\nHands-on experience with:\nJenkins and ArgoCD for CI/CD.\nTerraform.\nHelm.\nKubernetes operations and application deployment.\nInfrastructure and application monitoring and alerting using the Grafana LGTM stack.\nCloudflare operations include DNS Management, Proxy, SSL/TLS, WAF basics, and Analytics and Logs.\nFamiliar with databases: Microsoft SQL Server, MongoDB, Redis, Elasticsearch, PostgreSQL, Kafka.\nWillingness to participate in on-call rotation and respond to mid-night or after-hours incidents when required.\nAbility to communicate effectively in English.\nNice to Have\nA security-first mindset and awareness of cloud security practices, Kubernetes hardening practices (Pod Security Policies, image scanning, audit logs).\nExposure to Azure Cloud environments.\nScripting knowledge in Bash, Python, or similar.\n Soft Skills\nPassionate individual who values team culture and collaboration.\nDemonstrates a willingness to learn and grow with new technologies.\nStrong problem-solving and troubleshooting abilities.\nUnderstands best practices in building highly available and resilient systems.\nCommunicates clearly and works effectively in a cross-functional team.", "company_name": "Mercatus", "company_url": "https://itviec.com/companies/mercatus", "company_type": "IT Product", "company_industry": "Software Products and Web Services", "company_size": "151-300 employees", "country": "United States", "working_days": "Monday - Friday", "overtime_policy": "No OT", "employment_benefits": ["Competitive income with 13th month salary", "Annual leave: 12 days/year and other leaves/public holidays in accordance with the Labor Law of Vietnam", "Periodic medical checkup, Health/Social Insurance.  (PIJCO Insurance after 10 months of employment)", "Be provided with high-performance laptop and screen", "Opportunity to experience a great workplace where young & world-class talents work together passionately", "Very diverse offline and online seminars & workshops provided by company, supervisors, mentors and buddies", "Clear and flexible career path", "Working in a progressive and international environment.", "Complimentary snacks, fruits, drinks everyday.", "Team building, company trip and monthly internal events."], "year": 2025.0, "month": 12.0, "day": 14.0, "normalized_level": "Senior", "normalized_exp_years": 0.0, "normalized_skills": ["DevOps", "AWS", "Agile"]}
{"url": "https://itviec.com/it-jobs/front-end-developer-react-typescript-persol-career-tech-studio-vietnam-3242", "job_title": "Front End Developer (React, Typescript)", "work_model": "Hybrid", "address": "6th Floor An Phu Plaza, Vo Thi Sau Ward, District 3, District 3, Ho Chi Minh", "required_skills": ["ReactJS", "TypeScript", "CSS"], "time_posted_raw": "2025-12-24", "job_description": "Development and maintenance in Front-end area \nTools and libralies investigation \nFront-end testing \nActively update knowledge for the organization \nFor senior level: Supporting Lead Frontend Developer to manage junior/fresher members", "your_skills_experience": "Must:\nThis level able to develop under the direction of the Lead Engineer \nWillingness to develop and improve services with the sense of ownership \nDeep knowledge of JavaScript(ES5/ES6) and TypeScript, HTML, CSS \nBasic knowledge of framework such as React or Vue.js and development experience with them \nExperience in API - base development in Front-end area \nBasic knowledge and experience with the state management libraries ( Flux , Redux ) \nExperience in unit test using Jest etc \nExperience in team development with using Git\nPreferable:\nExperience with Next.js \nExperience in performance-oriented development in the front-end area \nExperience developing back-end using any languages \nExperience with web application development using cloud service such as AWS \nExperience with the analytics tools such as Google Analytics \nExperience with Scrum development\nOnline Interview Process: Test code => 1st Interview(Technical) => Final Interview (Culture Fit Check) => Offer", "company_name": "Persol Career Tech Studio Vietnam", "company_url": "https://itviec.com/companies/persol-career-tech-studio-vietnam", "company_type": "IT Product", "company_industry": "Software Products and Web Services", "company_size": "51-150 employees", "country": "Japan", "working_days": "Monday - Friday", "overtime_policy": "No OT", "employment_benefits": ["Annual Leave: 15 days/ year", "Flexible Working Time (Hybrid Working & Flexible Check-in)", "100% Salary in Probation", "Salary Review (Twice a Year)", "13th Salary bonus", "Social Insurance for 100% Salary", "Travel Allowance", "Premium Health Care Insurance for employees (PTI)", "Annual Health Check", "Full Device Provide, Monitors,..", "Monthly Happy Hour, Company Trip, Year End Party and Events", "Marriage / Baby Gift", "Funeral Expenses", "Referral Bonus", "Skill Improvement Course for Employees (Udemy)"], "year": 2025.0, "month": 12.0, "day": 24.0, "normalized_level": "Junior", "normalized_exp_years": 0.0, "normalized_skills": ["ReactJS", "TypeScript", "CSS"]}
{"url": "https://itviec.com/it-jobs/senior-backend-developer-python-golang-cong-ty-cp-dich-vu-tmdt-n-h-2100", "job_title": "Senior Backend Developer (Python/Golang)", "work_model": "At office", "address": "Số 9 đường Trà Khúc, Phường Tân Sơn Hoà, Tan Binh, Ho Chi Minh", "required_skills": ["Python", "Golang", "MySQL", "Django"], "time_posted_raw": "2025-12-16", "job_description": "Vị trí: Senior Backend Engineering\nBáo cáo cho: Head of Engineering\nLàm việc cùng: Product Owner, Engineer, CS, Kế toán, Vận hành\nTổng Quan Vài trò\nOnflow là công ty cung cấp giải pháp Fulfillment B2B2C với hệ thống in-house (OMS, WMS, TMS, OPS, Data Platform). Trong giai đoạn scale mạnh, chúng tôi hướng tới xử lý 30.000 – 100.000 đơn/ngày, phát triển SaaS Fulfillment Platform phục vụ khách hàng B2B. \nĐể hiện thực hóa mục tiêu này, chúng tôi đang tìm kiếm Senior Backend Engineer có năng lực dẫn dắt và giải quyết các bài toán hệ thống phức tạp.\nTrách nhiệm công việc\nThiết kế, xây dựng và tối ưu hệ thống backend cho OMS/WMS/TMS theo kiến trúc microservice.\nPhân tích & xử lý các bài toán high-scale, high-concurrency, đảm bảo scalability & high availability.\nThiết kế & triển khai job system: đồng bộ & bất đồng bộ (async tasks, worker queues, batch jobs, real-time event streaming).\nThiết kế & phát triển API chuẩn REST/OpenAPI, dễ dàng mở rộng và tích hợp với hệ sinh thái ERP/CRM/eCommerce.\nRefactor các hệ thống monolithic hiện tại sang modular/microservice.\nLàm việc chặt chẽ với team Data/DevOps để triển khai hệ thống distributed, cloud-native.\nTham gia vào quá trình code review, mentoring cho các thành viên backend junior/middle.\nĐề xuất và áp dụng best practices về coding, testing, CI/CD, logging, monitoring, security.", "your_skills_experience": "Yêu cầu ứng viên\n3–5+ năm kinh nghiệm backend.\nThành thạo một trong các ngôn ngữ backend hiện đại: Python (Django/FastAPI/Flask) hoặc Golang (ưu tiên Golang nếu có kinh nghiệm thực tế ở môi trường high-scale).\nHiểu sâu về kiến trúc microservice, event-driven system, messaging queue (Kafka, RabbitMQ, Celery, Redis queue).\nCó kinh nghiệm với cloud environment (AWS, GCP, hoặc DigitalOcean), CI/CD, containerization (Docker, Kubernetes).\nKinh nghiệm xử lý high-scale system: concurrent requests, async jobs, database sharding/replication, caching (Redis/Memcached).\nHiểu sâu về PostgreSQL/MySQL (query tối ưu, transaction, indexing, partitioning).\nCó kinh nghiệm xây dựng observability stack (logging, monitoring, tracing).\nƯu tiên ứng viên từng làm trong lĩnh vực e-commerce, logistics, fulfillment.\nKỹ năng phân tích & giải quyết vấn đề hệ thống phức tạp, tư duy “scale & reliability first”.\nGiao tiếp tốt, sẵn sàng mentoring team junior/middle.\nĐiểm cộng\nKinh nghiệm triển khai multi-tenant SaaS platform.\nKiến thức security by design, RBAC, OAuth2, API security.\nHiểu biết event sourcing, CQRS, domain-driven design (DDD).", "company_name": "Công ty CP dịch vụ TMĐT N&H", "company_url": "https://itviec.com/companies/cong-ty-cp-dich-vu-tmdt-n-h", "company_type": "Non-IT", "company_industry": "Transportation, Logistics and Warehouse", "company_size": "151-300 employees", "country": "Vietnam", "working_days": "Monday - Saturday", "overtime_policy": "No OT", "employment_benefits": ["Lương cạnh tranh theo năng lực (thỏa thuận khi phỏng vấn).", "Môi trường startup tech được trao quyền & sáng tạo.", "Cơ hội tham gia xây dựng hệ thống Fulfillment SaaS quy mô và chuyên nghiệp tại Việt Nam.", "Được training & tiếp cận công nghệ hiện đại: cloud-native, big data, AI/ML integration.", "Lộ trình phát triển sự nghiệp rõ ràng (Tech Lead/Architect).", "Làm việc fulltime tại HCM .", "Báo cáo trực tiếp: Head of Engineering."], "year": 2025.0, "month": 12.0, "day": 16.0, "normalized_level": "Senior", "normalized_exp_years": 0.0, "normalized_skills": ["Python", "Golang", "MySQL", "Django"]}
{"url": "https://itviec.com/it-jobs/senior-devops-platform-engineer-zuhlke-engineering-vietnam-4354", "job_title": "Senior DevOps / Platform Engineer", "work_model": "Hybrid", "address": "The Sentry P Building - 7th Floor, 16 Nguyen Dang Giai, Thao Dien Ward, Thu Duc City, Ho Chi Minh City, Vietnam, Thu Duc City, Ho Chi Minh", "required_skills": ["DevSecOps", "Kubernetes", "AWS"], "time_posted_raw": "2025-12-24", "job_description": "Founded in Switzerland in 1968, Zühlke is owned by its partners and located across Europe and Asia. We are a global transformation partner, with engineering and innovation in our DNA. We're trusted to help clients envision and build their businesses for the future – to run smarter today while adapting for tomorrow’s markets, customers, and communities. Our multidisciplinary teams specialise in tech strategy and business innovation, digital solutions and applications, and device and systems engineering. We excel in complex, regulated spaces including health and finance, connecting strategy, tech implementation, and operational services to help clients become more effective, resilient businesses.\n If you share our values and want to do the best work, for the right reasons, we can offer you the chance to do it on a global scale and play a real role in shaping our exciting journey.\n The Role\nBring your passion for DevOps and platform engineering to life by enabling modern, automated cloud-native delivery across complex enterprise environments. As a DevOps Engineer, you will work in agile, multidisciplinary teams to design, build, and operate scalable platforms that empower developers and accelerate delivery for projects.\n In this role, you’ll drive GitOps and Everything-as-Code practices, architect advanced CI/CD pipelines, and build self-service, on-demand environments that improve developer experience and productivity. You’ll be hands-on with Kubernetes operations, infrastructure automation, observability engineering, cloud-native security, and modern deployment strategies.\n You will shape end-to-end DevOps capabilities—from automated environment provisioning and secure service mesh networking to monitoring-as-code, secrets automation, and resilient runtime operations. Your work will ensure faster releases, higher reliability, and stronger compliance in a mission-critical environment.\n At Zühlke, we value craftsmanship, collaboration, and continuous learning. You’ll work closely with our global community of experts, supported by cutting-edge tools and a culture that encourages curiosity and innovation.", "your_skills_experience": "What’s Important to Us\nYou bring a blend of technical depth and consulting mindset, ideally from DevOps, cloud transformation, or platform engineering roles. You are comfortable exploring new technologies, simplifying complex systems, and working directly with clients to guide engineering best practices.\n 5+ years of experience in DevOps or platform engineering in enterprise or consulting environments.\nStrong expertise with AWS, including EKS, networking, IAM, security, automation, and managed services.\nProficiency in Infrastructure as Code (Terraform, Pulumi, CloudFormation).\nHands-on experience building scalable CI/CD pipelines using GitHub Actions, GitLab CI, CircleCI, or Jenkins.\nStrong Linux fundamentals and scripting skills (Python, Bash, or similar).\nProficiency in containerization and Kubernetes, including Helm, Kustomize, and automated cluster operations.\nExperience implementing GitOps workflows with Argo CD or similar tools.\nSolid understanding of cloud networking, ingress controllers, load balancers, VPC design, and service discovery.\nExperience with observability platforms such as Datadog, Grafana, Prometheus, ELK, or Dynatrace.\nFamiliarity with DevSecOps tooling such as SonarQube, Snyk, Trivy, Vault, and AWS Secrets Manager.\nExperience with automated testing, quality gates, and performance testing frameworks (e.g., Testcontainers, JUnit/Kotest, k6).\nOperating databases and caching layers (RDS/Aurora, PostgreSQL, DynamoDB, Redis).\nManaging API gateways (Kong, API Gateway, Apigee) and event streaming platforms (Kafka/MSK, RabbitMQ, SQS).\nKnowledge of chaos engineering, resilience testing, or policy-as-code (OPA).\nAWS, Kubernetes, or Terraform certifications.\nYou communicate effectively, work well in agile teams, and thrive in an environment that values continuous improvement, sharing knowledge, and delivering lasting impact for clients.", "company_name": "Zuhlke Engineering Vietnam", "company_url": "https://itviec.com/companies/zuhlke-engineering-vietnam", "company_type": "IT Service and IT Consulting", "company_industry": "IT Services and IT Consulting", "company_size": "1000+ employees", "country": "Switzerland", "working_days": "Monday - Friday", "overtime_policy": "No OT", "employment_benefits": ["Work life blend: we offer a safe & healthy workplace, with flexible working hours and the possibility to work from home", "Profit share scheme: In addition to your annual salary, you may receive a profit share defined by the company’s success in the previous year", "Global and Diverse Zühlke community: witness how colleagues from all our 17 offices across the globe come together to create a unique, positive and inclusive work culture, learning from one another at annual team camps, and celebrating year-end parties and other local festivities.", "Committed to development: we are committed to the growth of our people and are investing in your development. We’re empowering you to build the skills you need to make a positive impact, both personally and for our clients, today and in the future."], "year": 2025.0, "month": 12.0, "day": 24.0, "normalized_level": "Senior", "normalized_exp_years": 0.0, "normalized_skills": ["DevSecOps", "Kubernetes", "AWS"]}
{"url": "https://itviec.com/it-jobs/senior-data-engineer-chotot-2114", "job_title": "Senior Data Engineer (Cloud, Go, Python, Scala)", "work_model": "At office", "address": "UOA Tower - 6 Tan Trao, Tan Phu, District 7, Ho Chi Minh", "required_skills": ["Data Engineer", "Scala", "Python", "Golang", "Google Cloud", "Google BigQuery"], "time_posted_raw": "2025-12-13", "job_description": "Carousell Group is the leading online classifieds marketplace for secondhand goods in Southeast Asia, with a mission to inspire the world to sell and buy more sustainably. Chotot Data Engineering is a sub-team of Carousell Common Tech Foundation - Data Engineering, focused on building a self-service data infrastructure platform. Our team is dedicated to creating a robust platform that allows users to easily ingest, access, and transform data into valuable insights using familiar and comfortable tools. We are currently seeking a excellent Sr Data Engineer to join our team, you will have the opportunity to work on group level projects that deliver meaningful value and contribute to our missions in Southeast Asia\nResponsibilities:\nDevelop and build our data platforms (such as Feature Store, Streaming Platform, Event Platform …) to support business needs and enable data-driven decision making\nDevelop and build MLOps tools, platforms for data scientists and ML engineers to automate, standardize, and manage ML projects\nDesign solutions and build self-serve data infrastructure platforms for internal data users such as data ingestion, transformation, streaming processing. The goal is to improve the efficiency and effectiveness of using data across the group through self-service capabilities\nManage common data infrastructures components, such as orchestration tool, logging and monitoring, CI/CD, data governance\nResponsible for Cloud cost control via cloud Finops best practices\nBuild, maintain and efficiently scale complex data ETL, high-throughput real-time and offline data pipeline", "your_skills_experience": "Must to have:\n5+ years of experience in data engineering roles with BSc or MSc degree in Computer Science\nExperience building platforms for internal use, with a strong focus on self-service capabilities and efficient data processing\nExperience with Google Cloud Platform (GCP) services — e.g. BigQuery, Dataflow, Pub/Sub, Composer, GKE\nStrong proficiency in at least one of the following programming languages: Go,Python, Scala\nExcellent written and spoken English skills\nStrong scripting ability in Bash\nFamiliarity with designing and operating robust distributed systems\nAbility to quickly learn and adapt to new technologies.\nStrong attention to detail, self-motivated, and responsible.\nGood command of English, as you will collaborate closely with international teams.\nNice-to-Have:\nExperience working in large-scale consumer platforms or marketplace / e-commerce domains\nExposure to MLOps tools — e.g. MLflow, Kubeflow, Vertex AI, or SageMaker\nStrong collaboration experience with data scientists, analysts, and ML engineers", "company_name": "Chotot", "company_url": "https://itviec.com/companies/chotot", "company_type": "IT Product", "company_industry": "E-commerce", "company_size": "151-300 employees", "country": "Singapore", "working_days": "Monday - Friday", "overtime_policy": "No OT", "employment_benefits": ["Get 15 days of annual leave and 5 days of sick leave per year", "Health insurance for employee and their family members.", "Get a 13th-month salary and annual performance bonus.", "Participate in regular team-building activities and company parties.", "Full of learning and training opportunities to grow your professional and personal skills.", "Our modern offices serve perfectly for a relaxed, yet productive work environment."], "year": 2025.0, "month": 12.0, "day": 13.0, "normalized_level": "Senior", "normalized_exp_years": 0.0, "normalized_skills": ["Data Engineer", "Scala", "Python", "Golang", "Google Cloud", "Google BigQuery"]}
{"url": "https://itviec.com/it-jobs/middle-senior-expert-data-engineer-techcombank-3504", "job_title": "(Middle/Senior/Expert)- Data Engineer", "work_model": "At office", "address": "C5 Building Tower, D’Capitale Tower, 119 Tran Duy Hung, Cau Giay, Ha Noi", "required_skills": ["Data Engineer", "Databricks", "Spark", "Java", "Python", "Cloud"], "time_posted_raw": "2025-12-27", "job_description": "• Lead the team to improve scalability, reliability, and cost-efficiency of the Data Platform.\n• Design, build, and deploy data pipelines (batch & streaming) using Spark orchestrated via Airflow.\n• Develop libraries and frameworks for data ingestion, transformation, and governance with clean architecture principles.\n• Collaborate with Data Architects to design/review data models, enforce data contracts, and maintain schema governance.\n• Optimize performance with partitioning, caching, Z-Ordering, and metadata management in lakehouse environments (Delta/Iceberg/Hudi).\n• Ensure security and compliance: IAM, encryption, secrets management, and GDPR/CCPA adherence.\n• Drive CI/CD for data workflows, IaC (Terraform), and container orchestration (Kubernetes).\n• Monitor SLOs/SLAs, implement alerting, and lead incident responses and postmortems.\n• Design and operate end-to-end ML/LLM pipelines: data prep, training, evaluation, and deployment.\n• Build RAG architectures, vector search, and embedding pipelines for LLM-based applications.", "your_skills_experience": "1. Must have:\n• Bachelor’s or Master’s degree in Computer Science, Software Engineering, Information Technology, or a related technical field\n• English is required\n• Have 5+ years of experience as a Data Engineer or Software Engineer\n• Have experience in Cloud (AWS/Azure/GCP)\n• Extremely proficient in at least 1 programming language (Python/Scala/Java)\n• Strong experience in systems architecture – particularly in complex, scalable, and fault- tolerant distributed systems\n• Good at multi-threading, atomic operations, computation framework: Spark (DataFrame, SQL, ...), distributed storage, distributed computing\n• Understand designs of resilience, fault-tolerance, high availability, and high scalability, ...\n• Tools: CI/CD, Gitlab, ...\n• Good at communication & team working\n• Being open-minded, willing to learn new things\n2. Nice to have:\n• Experience with Databricks (Delta Lake, Unity Catalog, Delta Live Tables) or similar lakehouse technologies is a strong plus.\n• Proven ability in performance tuning and optimization for Big Data workloads (Spark/Flink, partitioning, shuffle strategies, caching).\n• Familiarity with modern data transformation frameworks (dbt).\n• Knowledgeable in AI and LLM technologies is a plus, including prompt engineering, embeddings, and retrieval-augmented generation (RAG).\n• Hands-on experience with vector databases (ChromaDB, Vector Search) and LLMOps practices.", "company_name": "Techcombank", "company_url": "https://itviec.com/companies/techcombank", "company_type": "IT Product", "company_industry": "Banking", "company_size": "1000+ employees", "country": "Vietnam", "working_days": "Monday - Friday", "overtime_policy": "No OT", "employment_benefits": ["Investing over 500 million USD to develop large-scale IT projects, Techcombank is one of the leading bank in Technology trends in Vietnam", "You will grow with Techcombank by having the opportunity to learn from top experts from across the world", "Techcombank provides a rewarding remuneration structure that commensurate with your achievement and contribution", "Techcombank is the Top 2 Best place to work in the banking industry where you can experience various exciting activities throughout the year: Company anniversary, Team building, Active Saturday , Year End Party, etc."], "year": 2025.0, "month": 12.0, "day": 27.0, "normalized_level": "Senior", "normalized_exp_years": 0.0, "normalized_skills": ["Data Engineer", "Databricks", "Spark", "Java", "Python", "Cloud"]}
{"url": "https://itviec.com/it-jobs/principal-frontend-engineer-reactjs-vuejs-andpad-vietnam-co-ltd-4911", "job_title": "Principal Frontend Engineer (ReactJS/VueJS)", "work_model": "Hybrid", "address": "3rd Floor, Dong Nhan Building, 90 Nguyen Dinh Chieu, Tan Dinh Ward, Ho Chi Minh", "required_skills": ["ReactJS", "Unit test", "VueJS", "Microservices", "JavaScript", "English"], "time_posted_raw": "2025-12-26", "job_description": "We are looking for a Principal Frontend Developer (ReactJS/VueJS) who can join to our team and develop the application in cooperation with the product manager, working in the form of Squad, a small team can quickly and consistently engage in everything from design to development, testing and operation.\nAlso, there are a lot of opportunities to work with new languages and FWs other than the main language in an international environment.\n■ Job Scope\nDesign and implementation function of the product in charge using ReactJS/VueJS\nImplement UI and improve UX close to the customer's business to realize DX promotion\nRequirements definition and specification formulation in collaboration with product managers and designers\nReview the design, programming of other engineers\n■ Development environment\nPrograming: TypeScript/HTML/CSS\nFramework: ReactJS, VueJS, NuxtJS, NextJS\nInfrastructure: AWS/GCP\nCI/CD: Circle CI/Bitrise/GitHub Actions\nKnowledge Tool: Confluence/esa\nVCS: GitHub\nOthers: Slack/Jira/Trello", "your_skills_experience": "Must have: \nEmpathy for Andpad's mission and values\n7+ years of experience in a software development role: Frontend Developer\nExperience with TypeScript language\nExperience with frontend frameworks (VueJS, ReactJS etc.)\nKnowledge and ability to explain principles of web operation and differences of browsers\nExperience as a technical lead throughout the full project development lifecycle\nBasic knowledge of Web application security\nSkills of development and operation using various frameworks\nExperience Test code implementation (Unit Test)\nGood at English communication\nNice to have: \nKnowledge of backend development (Golang/ Ruby on rails/ Others)\nExperienced developing Front-end microservices.\nExperience of discovering problems from logs and solving problems \nExperience of deciding and progressing the technical policy of the team as a tech lead.\nExperience of using and understanding of Library and Framework.\nExperience of publishing and contributing to OSS.", "company_name": "ANDPAD VietNam Co., Ltd", "company_url": "https://itviec.com/companies/andpad-vietnam-co-ltd", "company_type": "IT Product", "company_industry": "Software Products and Web Services", "company_size": "51-150 employees", "country": "Japan", "working_days": "Monday - Friday", "overtime_policy": "No OT", "employment_benefits": ["Competitive salary package, including full insurance coverage.", "Annual performance review: twice/ year.", "Year-end Bonus.", "Remote/ Hybrid working model.", "12 days of annual leave and maximum of 6 days for New Year Leave", "Premium Healthcare Insurance Package starting from day one.", "Annual Health Check-up.", "Excellent career development opportunities, with exposure to and experience in the latest technologies.", "Patents and Inventions bonus.", "Company trip, Year-End Party, Gifts for Tet/ Holidays.", "MacBook Pro/laptop is provided."], "year": 2025.0, "month": 12.0, "day": 26.0, "normalized_level": "Senior", "normalized_exp_years": 5.0, "normalized_skills": ["ReactJS", "Unit test", "VueJS", "Microservices", "JavaScript"]}
